import java.math.BigDecimal;
import java.util.Random;

public class Generator {

    private final String[] firstNames = {"Абрам", "Авраам", "Арсений", "Артем", "Артур", "Ашот", "Бенедикт", "Богдан", "Бонифаций", "Борис", "Вадим", "Валентин",
            "Валерий", "Вальдемар", "Варфоломей", "Василий", "Венедикт", "Вениамин", "Виктор", "Аркадий", "Виталий", "Владимир", "Владислав", "Андрей", "Всеволод",
            "Вячеслав", "Гавриил", "Геннадий", "Георгий", "Герасим", "Герман", "Амаяк", "Глеб", "Григорий", "Давид", "Анатолий", "Даниил", "Демьян", "Денис",
            "Дмитрий", "Добрыня", "Дорофей", "Евгений", "Евдоким", "Егор", "Елисей", "Емельян", "Еремей", "Ефим", "Антон", "Заур", "Захар", "Ибрагим", "Иван",
            "Игнат", "Игорь", "Измаил", "Илларион", "Илья", "Иоанн", "Инокентий", "Иосиф", "Ипполит", "Ираклий", "Исаак", "Искандер", "Ислам", "Исмаил", "Казимир",
            "Карен", "Алексей", "Карл", "Ким", "Кирилл", "Клавдий", "Константин", "Корней", "Кузьма", "Лавр", "Лаврентий", "Лазарь", "Лев", "Леон", "Леонид",
            "Леопольд", "Лука", "Макар", "Максим", "Максимильян", "Мансур", "Марат", "Марк", "Матвей", "Махмуд", "Мефодий", "Микула", "Мирон", "Митрофан", "Михаил",
            "Моисей", "Мстислав", "Мурат", "Мухаммед", "Наиль", "Наум", "Нестор", "Александр", "Никита", "Никифор", "Никодим", "Николай", "Олег", "Осип", "Остап",
            "Павел", "Петр", "Потап", "Ринат", "Руслан", "Святослав", "Семен", "Сергей", "Станислав", "Степан", "Тимофей", "Федор", "Федот", "Фома", "Ярослав",

    };

    private final String[] lastNames = {"Смирнов", "Иванов", "Кузнецов", "Соколов", "Попов", "Лебедев", "Козлов", "Новиков", "Морозов", "Петров",
            "Волков", "Соловьёв", "Васильев", "Зайцев", "Павлов", "Семёнов", "Голубев", "Виноградов", "Богданов", "Воробьёв", "Фёдоров", "Михайлов", "Беляев",
            "Тарасов", "Белов", "Комаров", "Орлов", "Киселёв", "Макаров", "Андреев", "Ковалёв", "Ильин", "Гусев", "Титов", "Кузьмин", "Кудрявцев", "Баранов",
            "Куликов", "Алексеев", "Степанов", "Яковлев", "Сорокин", "Сергеев", "Романов", "Захаров", "Борисов", "Королёв", "Герасимов", "Пономарёв", "Григорьев",
            "Лазарев", "Медведев", "Ершов", "Никитин", "Соболев", "Рябов", "Поляков", "Цветков", "Данилов", "Жуков", "Фролов", "Журавлёв", "Николаев",
            "Крылов", "Максимов", "Сидоров", "Осипов", "Белоусов", "Федотов", "Дорофеев", "Егоров", "Матвеев", "Бобров", "Дмитриев", "Калинин", "Анисимов",
            "Петухов", "Антонов", "Тимофеев", "Никифоров", "Веселов", "Филиппов", "Марков", "Большаков", "Суханов", "Миронов", "Ширяев", "Александров", "Коновалов",
            "Шестаков", "Казаков", "Ефимов", "Денисов", "Громов", "Фомин", "Давыдов", "Мельников", "Щербаков", "Блинов", "Колесников", "Карпов", "Афанасьев",
    };

    private final BigDecimal[] salaries = {new BigDecimal("50000"), new BigDecimal("65000"), new BigDecimal("78000"), new BigDecimal("89000")
            , new BigDecimal("101000"), new BigDecimal("123000"), new BigDecimal("148000"), new BigDecimal("222000")};

    public String generateName() {
        Random random = new Random();
        int firstnameIndex = random.nextInt(firstNames.length);
        int lastnameIndex = random.nextInt(lastNames.length);
        return lastNames[lastnameIndex] + " " + firstNames[firstnameIndex];
    }

    public BigDecimal generateSalary() {
        Random random = new Random();
        int salaryIndex = random.nextInt(salaries.length);
        return salaries[salaryIndex];
    }

}
